// $0.getBoundingClientRect() позволяет получить доступ к css файла
// страница парсица с левого верхнего угла 
//$0.offsetTop позволяет узнать высоту
//$0.offsetLeft позволяет узнать длинну
//$0.clientTop
//$0.clientLeft
//$0.offsetWidth
//$0.offsetHeight
//$0.scrollHeight  позволяет узнать длинну контента внутри бокса в данном случае
//всё можно посмотреть на htmlArticl 
// window.history 
// location.ref
// navigator позволяется вам посмотреть информацию  о сайте
// navigator.userAgent позволяет получить доступ к новигации 
//Date позволяет получить доступ к информации о дате на подобии времени числа и прочего 
//throw позворяет 